earlephilhower/arduino-pico/boards.txt
adafruitfeather.name=Adafruit Feather RP2040
adafruitfeather.vid.0=0x2e8a
adafruitfeather.pid.0=0x000b
adafruitfeather.build.usbpid=-DSERIALUSB_PID=0x000b
adafruitfeather.build.board=ADAFRUIT_FEATHER_RP2040
adafruitfeather.build.mcu=cortex-m0plus
adafruitfeather.build.variant=adafruitfeather
adafruitfeather.upload.tool=uf2conv
adafruitfeather.upload.maximum_size=8388608
adafruitfeather.upload.maximum_data_size=262144
adafruitfeather.upload.wait_for_upload_port=true
adafruitfeather.upload.erase_cmd=
adafruitfeather.serial.disableDTR=false
adafruitfeather.serial.disableRTS=false
adafruitfeather.build.f_cpu=125000000
adafruitfeather.build.led=
adafruitfeather.build.core=rp2040
adafruitfeather.build.mcu=rp2040
adafruitfeather.build.ldscript=memmap_default.ld
adafruitfeather.build.boot2=boot2_w25x10cl_4_padded_checksum
adafruitfeather.build.vid=0x239a
adafruitfeather.build.pid=0x80f1
adafruitfeather.menu.flash.8388608_0=8MB (no FS)
adafruitfeather.menu.flash.8388608_0.upload.maximum_size=8384512
adafruitfeather.menu.flash.8388608_0.build.flash_length=8384512
adafruitfeather.menu.flash.8388608_0.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_0.build.fs_start=276819968
adafruitfeather.menu.flash.8388608_0.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
adafruitfeather.menu.flash.8388608_65536.upload.maximum_size=8318976
adafruitfeather.menu.flash.8388608_65536.build.flash_length=8318976
adafruitfeather.menu.flash.8388608_65536.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_65536.build.fs_start=276754432
adafruitfeather.menu.flash.8388608_65536.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
adafruitfeather.menu.flash.8388608_131072.upload.maximum_size=8253440
adafruitfeather.menu.flash.8388608_131072.build.flash_length=8253440
adafruitfeather.menu.flash.8388608_131072.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_131072.build.fs_start=276688896
adafruitfeather.menu.flash.8388608_131072.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
adafruitfeather.menu.flash.8388608_262144.upload.maximum_size=8122368
adafruitfeather.menu.flash.8388608_262144.build.flash_length=8122368
adafruitfeather.menu.flash.8388608_262144.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_262144.build.fs_start=276557824
adafruitfeather.menu.flash.8388608_262144.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
adafruitfeather.menu.flash.8388608_524288.upload.maximum_size=7860224
adafruitfeather.menu.flash.8388608_524288.build.flash_length=7860224
adafruitfeather.menu.flash.8388608_524288.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_524288.build.fs_start=276295680
adafruitfeather.menu.flash.8388608_524288.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
adafruitfeather.menu.flash.8388608_1048576.upload.maximum_size=7335936
adafruitfeather.menu.flash.8388608_1048576.build.flash_length=7335936
adafruitfeather.menu.flash.8388608_1048576.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_1048576.build.fs_start=275771392
adafruitfeather.menu.flash.8388608_1048576.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
adafruitfeather.menu.flash.8388608_2097152.upload.maximum_size=6287360
adafruitfeather.menu.flash.8388608_2097152.build.flash_length=6287360
adafruitfeather.menu.flash.8388608_2097152.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_2097152.build.fs_start=274722816
adafruitfeather.menu.flash.8388608_2097152.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
adafruitfeather.menu.flash.8388608_3145728.upload.maximum_size=5238784
adafruitfeather.menu.flash.8388608_3145728.build.flash_length=5238784
adafruitfeather.menu.flash.8388608_3145728.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_3145728.build.fs_start=273674240
adafruitfeather.menu.flash.8388608_3145728.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
adafruitfeather.menu.flash.8388608_4194304.upload.maximum_size=4190208
adafruitfeather.menu.flash.8388608_4194304.build.flash_length=4190208
adafruitfeather.menu.flash.8388608_4194304.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_4194304.build.fs_start=272625664
adafruitfeather.menu.flash.8388608_4194304.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
adafruitfeather.menu.flash.8388608_5242880.upload.maximum_size=3141632
adafruitfeather.menu.flash.8388608_5242880.build.flash_length=3141632
adafruitfeather.menu.flash.8388608_5242880.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_5242880.build.fs_start=271577088
adafruitfeather.menu.flash.8388608_5242880.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
adafruitfeather.menu.flash.8388608_6291456.upload.maximum_size=2093056
adafruitfeather.menu.flash.8388608_6291456.build.flash_length=2093056
adafruitfeather.menu.flash.8388608_6291456.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_6291456.build.fs_start=270528512
adafruitfeather.menu.flash.8388608_6291456.build.fs_end=276819968
adafruitfeather.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
adafruitfeather.menu.flash.8388608_7340032.upload.maximum_size=1044480
adafruitfeather.menu.flash.8388608_7340032.build.flash_length=1044480
adafruitfeather.menu.flash.8388608_7340032.build.eeprom_start=276819968
adafruitfeather.menu.flash.8388608_7340032.build.fs_start=269479936
adafruitfeather.menu.flash.8388608_7340032.build.fs_end=276819968
adafruitfeather.menu.freq.125=125 MHz
adafruitfeather.menu.freq.125.build.f_cpu=125000000L
adafruitfeather.menu.freq.50=50 MHz
adafruitfeather.menu.freq.50.build.f_cpu=50000000L
adafruitfeather.menu.freq.100=100 MHz
adafruitfeather.menu.freq.100.build.f_cpu=100000000L
adafruitfeather.menu.freq.133=133 MHz
adafruitfeather.menu.freq.133.build.f_cpu=133000000L
adafruitfeather.menu.freq.150=150 MHz (Overclock)
adafruitfeather.menu.freq.150.build.f_cpu=150000000L
adafruitfeather.menu.freq.175=175 MHz (Overclock)
adafruitfeather.menu.freq.175.build.f_cpu=175000000L
adafruitfeather.menu.freq.200=200 MHz (Overclock)
adafruitfeather.menu.freq.200.build.f_cpu=200000000L
adafruitfeather.menu.freq.225=225 MHz (Overclock)
adafruitfeather.menu.freq.225.build.f_cpu=225000000L
adafruitfeather.menu.freq.250=250 MHz (Overclock)
adafruitfeather.menu.freq.250.build.f_cpu=250000000L
adafruitfeather.menu.freq.275=275 MHz (Overclock)
adafruitfeather.menu.freq.275.build.f_cpu=275000000L
adafruitfeather.menu.freq.300=300 MHz (Overclock)
adafruitfeather.menu.freq.300.build.f_cpu=300000000L
adafruitfeather.menu.dbgport.Disabled=Disabled
adafruitfeather.menu.dbgport.Disabled.build.debug_port=
adafruitfeather.menu.dbgport.Serial=Serial
adafruitfeather.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruitfeather.menu.dbgport.Serial1=Serial1
adafruitfeather.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruitfeather.menu.dbgport.Serial2=Serial2
adafruitfeather.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruitfeather.menu.dbglvl.None=None
adafruitfeather.menu.dbglvl.None.build.debug_level=
adafruitfeather.menu.dbglvl.Core=Core
adafruitfeather.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruitfeather.menu.dbglvl.SPI=SPI
adafruitfeather.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruitfeather.menu.dbglvl.Wire=Wire
adafruitfeather.menu.dbglvl.Wire.build.debug_level=DDEBUG_RP2040_WIRE
adafruitfeather.menu.dbglvl.All=All
adafruitfeather.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
adafruitfeather.menu.dbglvl.NDEBUG=NDEBUG
adafruitfeather.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruitfeather.menu.usbstack.picosdk=Built-in
adafruitfeather.menu.usbstack.picosdk.build.flags.usbstack="-I{runtime.platform.path}/pico-sdk/lib/tinyusb/src/"
adafruitfeather.menu.usbstack.tinyusb=TinyUSB
adafruitfeather.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB "-I{build.core.path}/TinyUSB" "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

